{"Diary/Why-I-started-this-blog":{"title":"Why I started this blog","links":[],"tags":[],"content":"First, I’m just a normal, small, humble human but I have programming skills. I already have some blogs in platform such as Naver, Tistory. A few years ago(2022), There was a data center fire accident. During the recovery from this accident, my biggest blog on Tistory was totally broken. I couldn’t sign in and All my posted data was lost. The SEO rankings were gone, so blog’s visitor count extremely decreased.\n I was taking full advantage of the convenience provided there, but it occurred to me that I could potentially lose all my data. Of course, all the data has been recovered now. However, the lost SEO rankings mean the visitor count has not recovered yet.\nI know how much GitHub values users’ code through projects like the Arctic Code Vault Contributor. And by chance, when I had Google check for personal information leaks, I found out that my code had been taken from the deep web. So, whether intentional or not, anything I upload to GitHub gets copied around the internet in various places.\n I used to have Google Adsense ads running to generate some revenue, but after realizing that the price of having those ugly banners on my site was only about a cup of coffee per month, I removed all the ads. Therefore, ad-friendly features are not an important consideration for me.\nSo that’s why I chose this. Following the initial sentence “First, I’m just a normal, small, humble human but I have programming skills” by doing this, I feel like I can leave a small but permanent trace that I existed as a person."},"Diary/Why-I'm-into-working-out-lately":{"title":"Why I'm into working out lately","links":["Thoughts/Everything-depends-on-probability"],"tags":[],"content":"I think “Everything depends on probability”. As a wrote, As I mentioned, regardless of ability, everything is governed by probability. Even if you study hard, there is a chance of getting a low score; even if you study investment, there is a chance of losing money; and even if you prepare thoroughly for a job, there is a chance of not getting into the company you want.\nHowever, in the case of exercise, the probability that your efforts will directly translate into results is incomparably higher. It seems to be almost 100%. It helps for mental health too. When we push our bodies to the limit, our survival instinct leaves only the most important issues in our minds.\nLately, when the output of my efforts in many areas hasn’t been good, exercise has never let me down. It’s like diversifying investments to manage risk and mental health; incorporating an activity with certain results, like exercise, seems to be a good approach for the long run."},"Learn-from-failure/01.--Prologue":{"title":"01. Prologue","links":[],"tags":[],"content":"My personal philosophy about life has been influenced a lot by Buddha. I don’t know much about Buddhist teachings, but I think it’s because I believe there isn’t a phrase more universally applicable to the entirety of human life than ‘life is suffering’.\n\nThe basis of life is suffering, living for fleeting moments of happiness.\n"},"The-super-verbose-me/00.-Me":{"title":"00. Me","links":[],"tags":["The-super-verbose-me"],"content":"www.linkedin.com/in/gyudoza/"},"The-super-verbose-me/01.-The-oldest-memories":{"title":"01. The oldest memories","links":[],"tags":["The-super-verbose-me"],"content":"My oldest memory is of me crossing the crosswalk with my hand raised above. But there’s was a problem. When I was young, I was so foolish that I didn’t know how to look at traffic lights. I thought I could just cross with my hand raised, so I almost got into a traffic accident.\n As was common in Korea in the 1990s, from around the age of five or six, I wandered around the neighborhood by myself. It was in Ahyeon 1-dong, Mapo-gu, Seoul.\nMy mother used to run a small snack shop selling tteokbokki, kimbap, and other snacks. At that time, the historic gas explosion incident occurred. My mother said,\n\n“I saw a strange haze rising from Ahyeon Park, and soon after, an explosion occurred. It was so hot that it was difficult to go outside the store. However, I was carrying you, and with the thought of saving you, I forced open the door and evacuated.”\n\nThere are still burn scars on my mother’s left shoulder from rescuing me. This is the burden of my heart for the rest of my life. And I stayed with my family at the Mapo Library, which served as a temporary shelter, and played with a toy horse that moves with an air pump.\n\nExactly the same as this. I can’t believe they’re still selling this.\n\nAnd other pieces are kindergarten-related memories. While I study writing Korean, the word ‘\b폭탄(bomb)’ came up. I was a normal foolish mischievous child, So I repeatedly acted as if I had been hit by a bomb. My friends around me saw that and laughed, and I remember feeling really happy about it.\n I also remember exposing my butt at kindergarten after watching Crayon Shin-chan, and getting a smack on the butt from my mom.\n There was a Christmas event where a teacher dressed as Santa handed out gifts, but my parents were very busy, so I remember going with my sister to buy the gift that I would receive myself. It wasn’t a Game Boy, but just a really old, outdated handheld gaming device. I wanted to have that and i got it in my hands.\n\nIt looked like this\nSo, I realized from a very young age that there was no Santa Claus.\nIn the Kindergarten, There was an extremely cute and pretty one-year-younger sister named Go Bo-gyeong, and I always played prince and princess with her. Sometimes these days, Still I remember playing with that child on the slide in the kindergarten yard. Her smiling face was truly beautiful."},"The-super-verbose-me/02.-Elementary-school":{"title":"02. Elementary school","links":[],"tags":["The-super-verbose-me"],"content":"This is my second memory."},"The-super-verbose-me/03.-Middle-school":{"title":"03. Middle school","links":[],"tags":["The-super-verbose-me"],"content":"Middle school memories"},"The-super-verbose-me/04.-High-school":{"title":"04. High school","links":[],"tags":["The-super-verbose-me"],"content":"High school memories"},"Thoughts/Everything-depends-on-probability":{"title":"Everything depends on probability","links":[],"tags":[],"content":"In the world, everything depends on probability. Studying for an exam is an act of increasing the probability of getting a high score in the exam, while studying stocks is an act of increasing the probability of gaining profits in the stock market.\n However, unexpected events like getting an upset stomach on exam day or financial crises like the mortgage crisis can also occur in the stock market.\nEven with outstanding abilities, if one does not receive the blessing of probability, no matter how much effort one puts in, they may not achieve the desired results."},"index":{"title":"Welcome to 🫀 Exoheart","links":["Learn-from-failure/01.--Prologue","The-super-verbose-me/00.-Me"],"tags":[],"content":"Hi I’m gyudoza, and I always introduce myself as a programmer who enjoys trial and error. Throughout my life, I’ve made countless mistakes, and they’ve shaped who I am today. You can read about some of those failures here(Series - Learn from failure).\nYou can read me from here.\nThank you."}}